# Assignment 4 Questions

## Problem Statement

Q.1 Given a sequence of n values x1, x2, ..., xn and a window size k>0, the k-th moving average of
the given sequence is defined as follows:

The moving average sequence has n-k+1 elements as shown below.
The moving averages with k=4 of a ten-value sequence (n=10) is shown below

    i 1 2 3 4 5 6 7 8 9 10
    ===== == == == == == == == == == ==
    Input 10 20 30 40 50 60 70 80 90 100
    y1 25 = (10+20+30+40)/4
    y2 35 = (20+30+40+50)/4
    y3 45 = (30+40+50+60)/4
    y4 55 = (40+50+60+70)/4
    y5 65 = (50+60+70+80)/4
    y6 75 = (60+70+80+90)/4
    y7 85 = (70+80+90+100)/4

Thus, the moving average sequence has n-k+1=10-4+1=7 values.

Write a function to find moving average in an array over a window:

Test it over [3, 5, 7, 2, 8, 10, 11, 65, 72, 81, 99, 100, 150] and window of 3.

In [7]:
elements =  [3, 5, 7, 2, 8, 10, 11, 65, 72, 81, 99, 100, 150]
k = 3

def find_mov_avg(elements,k): 
  mov_avg = []
  for i in range(len(elements)-k+1):
    sum = 0
    for j in range(i,i+k):
      sum = sum + elements[j]
    avg = sum/k
    mov_avg.append(avg)
  return mov_avg

print(find_mov_avg(elements,k))

[5.0, 4.666666666666667, 5.666666666666667, 6.666666666666667, 9.666666666666666, 28.666666666666668, 49.333333333333336, 72.66666666666667, 84.0, 93.33333333333333, 116.33333333333333]

Q.2 How-to-count-distance-to-the-previous-zero
For each value, count the difference back to the previous zero (or the start of the Series,
whichever is closer)
create a new column 'Y'
Consider a DataFrame df where there is an integer column 'X'
    
    import pandas as pd
    df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})

In [33]:
import pandas as pd
df = pd.DataFrame({'X': [7,2,0,3,0,0,3,3,0,3,0,3,0,2,4,0]})
values = df.X
diff = [0]
for x in range(1,len(values)):
  count = 0
  for y in range(x-1,-1,-1):
    count += 1
    if values[y] == 0 or y == 0:
      diff.append(count)
      count = 0
      break

df['Y'] = pd.Series(diff)
print(df)

    X  Y
0   7  0
1   2  1
2   0  2
3   3  1
4   0  2
5   0  1
6   3  1
7   3  2
8   0  3
9   3  1
10  0  2
11  3  1
12  0  2
13  2  1
14  4  2
15  0  3

Q.3 Create a DatetimeIndex that contains each business day of 2015 and use it to index a Series of
random numbers.

In [14]:
import datetime
import pandas as pd
import numpy as np
start = datetime.datetime(2015,1,1)
end = datetime.datetime(2015,12,31)

index = pd.bdate_range(start,end)
df = pd.DataFrame(data=np.random.randint(100,size=len(index)), index=index, columns=['Number'])
print(df)

            Number
2015-01-01      19
2015-01-02      41
2015-01-05      51
2015-01-06      51
2015-01-07      30
...            ...
2015-12-25      81
2015-12-28      96
2015-12-29      35
2015-12-30      80
2015-12-31      87

[261 rows x 1 columns]

Q.4